cf/DataProcessors/_DemoSourceDocumentsOriginalsRecordingJournal.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>_DemoSourceDocumentsOriginalsRecordingJournal</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf/Catalogs/MetadataObjectIDs.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>MetadataObjectIDs</Name>
			<Comment>APK: 304-No. 697.1.2 updating predefined data instead of Auto, you need to set Do not update automatically, because predefined elements are mapped to data programmatically</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>CollectionOrder</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Name</Name>
					<Comment>For Example, "Objectualization"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Synonym</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FullName</Name>
					<Comment>For Example, "Provideguarantees.Objectarraylist"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>430</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FullSynonym</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>430</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NoData</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmptyRefValue</Name>
					<Comment>APK:1330-No. 728.2.1 it is Acceptable to use a universal reference type, since this is a universal mechanism and there is little data</Comment>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MetadataObjectKey</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NewRef</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.MetadataObjectIDs</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/DataProcessors/_DemoSourceDocumentsOriginalsRecordingJournal/Forms/DocumentsKindsFilterSettingForm/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//
//

#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)

	FillInDocumentViewSelectionList();

	If Parameters.FilterDocumentsKinds.Count() > 0 Then

		For Each DocumentKind In DocumentsKindsTable Do
			DocumentKind.Filter = False;
		EndDo;

		For Each DocumentKind In Parameters.FilterDocumentsKinds Do
			Filter = New Structure("DocumentKind", DocumentKind.Value);
			FoundRows = DocumentsKindsTable.FindRows(Filter);
			If ValueIsFilled(FoundRows) Then
				For Each String In FoundRows Do
					String.Filter = True;
				EndDo;
			EndIf;
		EndDo;
		
	Else
		
		For Each DocumentKind In DocumentsKindsTable Do
			DocumentKind.Filter = True;
		EndDo;
		
	EndIf;

EndProcedure

#EndRegion

#Region FormCommandsEventHandlers

&AtClient
Procedure WillSelectAllCheckBoxes(Command)

	For Each CurrentFilter In DocumentsKindsTable Do
		CurrentFilter.Filter = True;
	EndDo;

EndProcedure

&AtClient
Procedure ClearAllCheckBoxes(Command)

	For Each CurrentFilter In DocumentsKindsTable Do
		CurrentFilter.Filter = False;
	EndDo;

EndProcedure

&AtClient
Procedure AllTypesOfDocumentsOK(Command)

	FillInListOfDocumentsByDocumentType();
	Result = New Structure("FilterDocumentsKinds,DocumentsCount",FilterDocumentsKinds,DocumentsKindsTable.Count());
	Close(Result);

EndProcedure

#EndRegion

#Region Private

&AtServer
Procedure FillInDocumentViewSelectionList()

	TableOfSpecies = FormAttributeToValue("DocumentsKindsTable");
	TableOfSpecies.Clear();

	AvailableTypes = Metadata.DefinedTypes.ObjectWithSourceDocumentsOriginalsAccounting.Type.Types();
	DocumentNames = New Array;
	For Each Type In AvailableTypes Do
		If Type = Type("CatalogRef.MetadataObjectIDs") Then
			Continue;
		EndIf;
		DocumentType = Metadata.FindByType(Type);
		DocumentNames.Add(DocumentType.FullName());
	EndDo;
	
	Query = New Query;
	Query.Text = "SELECT
	               |	MetadataObjectIDs.FullName AS FullName,
	               |	MetadataObjectIDs.Synonym AS Synonym,
	               |	MetadataObjectIDs.Ref AS Ref
	               |FROM
	               |	Catalog.MetadataObjectIDs AS MetadataObjectIDs
	               |WHERE
	               |	MetadataObjectIDs.FullName IN(&DocumentNames)";
	Query.SetParameter("DocumentNames",DocumentNames);
	Selection = Query.Execute().Select();
	While Selection.Next() Do
		Filter = New Structure("Presentation", Selection.Synonym);
		FoundRows = TableOfSpecies.FindRows(Filter);
		If FoundRows.Count()= 0 Then
			NewRow = TableOfSpecies.Add();
			NewRow.DocumentKind = Selection.Ref;
			NewRow.Presentation = Selection.Synonym;
			NewRow.Filter = True;
		EndIf;
	EndDo;

	TableOfSpecies.Sort("Presentation");
	ValueToFormAttribute(TableOfSpecies, "DocumentsKindsTable");
	
EndProcedure

&AtServer
Procedure FillInListOfDocumentsByDocumentType()

	FilterDocumentsKinds.Clear();
	
	For Each DocumentKind In DocumentsKindsTable Do
			If DocumentKind.Filter = True Then
				FilterDocumentsKinds.Add(DocumentKind.DocumentKind,DocumentKind.Presentation);
			EndIf;
	EndDo;

	If FilterDocumentsKinds.Count() = 0 Then
		For Each DocumentKind In DocumentsKindsTable Do
			FilterDocumentsKinds.Add(DocumentKind.DocumentKind,DocumentKind.Presentation);
		EndDo;
	EndIf;

EndProcedure

#EndRegion
